In [53]:
import pandas as pd
import seaborn as sns

In [7]:
df=pd.DataFrame({
    "gender":["M","F","M","F"]
})

In [8]:
df

  gender
0      M
1      F
2      M
3      F

In [9]:
import sklearn
from sklearn.preprocessing import LabelEncoder

In [10]:
df= pd.DataFrame(
    {
        "class":["A","B","A","C","B","D"]
    }
)

In [11]:
l=LabelEncoder()
df["eclass"]=l.fit_transform(df["class"])

In [12]:
df

  class  eclass
0     A       0
1     B       1
2     A       0
3     C       2
4     B       1
5     D       3

In [13]:
df=pd.DataFrame({
    "temp":["hot","cold","veryhot","warm","cold"]
})

In [14]:
lencoder=LabelEncoder()
df["encoder"]=lencoder.fit_transform(df["temp"])
df

      temp  encoder
0      hot        1
1     cold        0
2  veryhot        2
3     warm        3
4     cold        0

In [15]:
df=pd.DataFrame({
    "temp":["hot","cold","veryhot","warm","cold"]
})

In [16]:
df["replace"]=df["temp"].replace({"cold":0 , "warm":1, "hot":2,"veryhot":3})
df

C:\Users\user\AppData\Local\Temp\ipykernel_1840\2155427947.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["replace"]=df["temp"].replace({"cold":0 , "warm":1, "hot":2,"veryhot":3})

      temp  replace
0      hot        2
1     cold        0
2  veryhot        3
3     warm        1
4     cold        0

In [17]:
d={"cold":0 , "warm":1, "hot":2,"veryhot":3}
df["map"]=df["temp"].map(d)
df

      temp  replace  map
0      hot        2    2
1     cold        0    0
2  veryhot        3    3
3     warm        1    1
4     cold        0    0

In [18]:
from sklearn.preprocessing import OrdinalEncoder

In [19]:
o=OrdinalEncoder()
df["or"]=o.fit_transform(df[["temp"]])
df

      temp  replace  map   or
0      hot        2    2  1.0
1     cold        0    0  0.0
2  veryhot        3    3  2.0
3     warm        1    1  3.0
4     cold        0    0  0.0

In [20]:
import category_encoders as ec

In [21]:
eco=ec.OrdinalEncoder(cols= "temp",return_df=True,
    mapping=[{
    "col":"temp" , "mapping":{"cold":0 , "warm":1 , "hot":2 , "veryhot":3}
    }])

In [22]:
eco.fit_transform(df)
df

      temp  replace  map   or
0      hot        2    2  1.0
1     cold        0    0  0.0
2  veryhot        3    3  2.0
3     warm        1    1  3.0
4     cold        0    0  0.0

In [23]:
df= pd.DataFrame(
    {
        "class":["A","R","A","C","B","D"]
    }
)

In [24]:
df["class"].nunique()

5

In [25]:
from sklearn.preprocessing import OneHotEncoder

In [26]:
onehot=OneHotEncoder()
e=onehot.fit_transform(df[["class"]]).toarray()
e

array([[1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 0., 1., 0.]])

In [27]:
e=pd.DataFrame(e,columns=onehot.get_feature_names_out(["class"]))
e

   class_A  class_B  class_C  class_D  class_R
0      1.0      0.0      0.0      0.0      0.0
1      0.0      0.0      0.0      0.0      1.0
2      1.0      0.0      0.0      0.0      0.0
3      0.0      0.0      1.0      0.0      0.0
4      0.0      1.0      0.0      0.0      0.0
5      0.0      0.0      0.0      1.0      0.0

In [28]:
df

  class
0     A
1     R
2     A
3     C
4     B
5     D

In [29]:
pd.concat([df,e],axis=1)

  class  class_A  class_B  class_C  class_D  class_R
0     A      1.0      0.0      0.0      0.0      0.0
1     R      0.0      0.0      0.0      0.0      1.0
2     A      1.0      0.0      0.0      0.0      0.0
3     C      0.0      0.0      1.0      0.0      0.0
4     B      0.0      1.0      0.0      0.0      0.0
5     D      0.0      0.0      0.0      1.0      0.0

In [30]:
df= pd.DataFrame(
    {
        "class":["A","R","A","C","B","D"]
    }
)

In [31]:
b=ec.BinaryEncoder()
b.fit_transform(df["class"])

   class_0  class_1  class_2
0        0        0        1
1        0        1        0
2        0        0        1
3        0        1        1
4        1        0        0
5        1        0        1

In [32]:
df= pd.DataFrame(
    {
        "city":["cairo","giza","alex","cairo","alex"], #x
        "target":[1,1,0,0,1] #y
    }
)

In [33]:
ten=ec.TargetEncoder()
ten.fit_transform(df["city"],df["target"])

       city
0  0.585815
1  0.652043
2  0.585815
3  0.585815
4  0.585815

In [46]:
df=pd.DataFrame(
    {
        "ages":[1,2,3,20,22,10,16,25,24,27,50,100]
    }
)

In [47]:

from sklearn.preprocessing import MinMaxScaler

In [48]:
scaler=MinMaxScaler()
df["minmax"]=scaler.fit_transform(df[["ages"]])

In [49]:
df

    ages    minmax
0      1  0.000000
1      2  0.010101
2      3  0.020202
3     20  0.191919
4     22  0.212121
5     10  0.090909
6     16  0.151515
7     25  0.242424
8     24  0.232323
9     27  0.262626
10    50  0.494949
11   100  1.000000

In [50]:
#standarization
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
df["standard"]=scaler.fit_transform(df[["ages"]])

In [51]:
df

    ages    minmax  standard
0      1  0.000000 -0.919007
1      2  0.010101 -0.880716
2      3  0.020202 -0.842424
3     20  0.191919 -0.191460
4     22  0.212121 -0.114876
5     10  0.090909 -0.574380
6     16  0.151515 -0.344628
7     25  0.242424  0.000000
8     24  0.232323 -0.038292
9     27  0.262626  0.076584
10    50  0.494949  0.957299
11   100  1.000000  2.871898

In [52]:
df.describe()

             ages     minmax      standard
count   12.000000  12.000000  1.200000e+01
mean    25.000000   0.242424  3.700743e-17
std     27.276363   0.275519  1.044466e+00
min      1.000000   0.000000 -9.190075e-01
25%      8.250000   0.073232 -6.413906e-01
50%     21.000000   0.202020 -1.531679e-01
75%     25.500000   0.247475  1.914599e-02
max    100.000000   1.000000  2.871898e+00

In [55]:
df=pd.DataFrame({
    "ages":[1,2,3,20,22,10,16,25,24,27,50,100],
    "salary":[1000,2000,3000,15000,9000,7000,15000,9000,7000,15000,9000,7000]
})

In [56]:
scaler=StandardScaler()
scaler.fit_transform(df[["ages","salary"]])

array([[-0.9190075 , -1.55085388],
       [-0.88071552, -1.336943  ],
       [-0.84242354, -1.12303212],
       [-0.1914599 ,  1.44389844],
       [-0.11487594,  0.16043316],
       [-0.57437969, -0.2673886 ],
       [-0.34462781,  1.44389844],
       [ 0.        ,  0.16043316],
       [-0.03829198, -0.2673886 ],
       [ 0.07658396,  1.44389844],
       [ 0.95729948,  0.16043316],
       [ 2.87189843, -0.2673886 ]])

In [57]:
from sklearn.preprocessing import RobustScaler

In [59]:
s=RobustScaler()
df[["nages","salaryscaled"]]=s.fit_transform(df[["ages","salary"]])

In [60]:
df

    ages  salary     nages  salaryscaled
0      1    1000 -1.159420     -1.555556
1      2    2000 -1.101449     -1.333333
2      3    3000 -1.043478     -1.111111
3     20   15000 -0.057971      1.555556
4     22    9000  0.057971      0.222222
5     10    7000 -0.637681     -0.222222
6     16   15000 -0.289855      1.555556
7     25    9000  0.231884      0.222222
8     24    7000  0.173913     -0.222222
9     27   15000  0.347826      1.555556
10    50    9000  1.681159      0.222222
11   100    7000  4.579710     -0.222222

In [68]:
import imblearn
from imblearn.over_sampling import RandomOverSampler

In [69]:
df=pd.DataFrame(
    {
        "city":["cairo","giza","alex","cairo","giza"],
        "temp":["hot","cold","veryhot","hot","cold"],
        "t":[1,1,1,0,0]
    }
)

In [70]:
x=df.drop(columns=["t"])
y=df["t"]

In [72]:
ROS=RandomOverSampler()
X,Y=ROS.fit_resample(x,y)

In [73]:
x

    city     temp
0  cairo      hot
1   giza     cold
2   alex  veryhot
3  cairo      hot
4   giza     cold

In [74]:
X

    city     temp
0  cairo      hot
1   giza     cold
2   alex  veryhot
3  cairo      hot
4   giza     cold
5  cairo      hot

In [ ]:
from imblearn.over_sampling import SMOTE

In [79]:
encoder=LabelEncoder()
df["city"]=encoder.fit_transform(df["city"])
df["temp"]=encoder.fit_transform(df["temp"])

In [80]:
df

   city  temp  t
0     1     1  1
1     2     0  1
2     0     2  1
3     1     1  0
4     2     0  0

In [81]:
x=df.drop(columns=["t"])
y=df["t"]

In [83]:
smt=SMOTE(k_neighbors=1)
X,Y=smt.fit_resample(x,y)

In [84]:
X

   city  temp
0     1     1
1     2     0
2     0     2
3     1     1
4     2     0
5     1     0

In [91]:
from imblearn.under_sampling import RandomUnderSampler

In [100]:
df=pd.DataFrame(
    {
        "city":["cairo","giza","alex","cairo","giza"],
        "temp":["hot","cold","veryhot","hot","cold"],
        "t":[1,1,1,0,0]
    }
)

In [93]:
x=df.drop(columns=["t"])
y=df["t"]

In [94]:
RUS=RandomUnderSampler()
X,Y=RUS.fit_resample(x,y)

In [89]:
x

    city     temp
0  cairo      hot
1   giza     cold
2   alex  veryhot
3  cairo      hot
4   giza     cold

In [95]:
X

    city  temp
3  cairo   hot
4   giza  cold
0  cairo   hot
1   giza  cold

In [101]:
from imblearn.under_sampling import ClusterCentroids

In [102]:
encoder=LabelEncoder()
df["city"]=encoder.fit_transform(df["city"])
df["temp"]=encoder.fit_transform(df["temp"])

In [103]:
x=df.drop(columns=["t"])
y=df["t"]

In [104]:
Cc=ClusterCentroids()
X,Y=Cc.fit_resample(x,y)

In [105]:
X

   city  temp
0     1     1
1     2     0
2     0     1
3     2     0

In [106]:
x

   city  temp
0     1     1
1     2     0
2     0     2
3     1     1
4     2     0